// Даны два числа. Показать большее и меньшее число

double numberA = 25;
double numberB = 196;

if (numberA > numberB)
{
    Console.Write(numberA);
    Console.WriteLine(" - большее число");

    Console.Write(numberB);
    Console.WriteLine(" - меньшее число");
}
else
{
    Console.Write(numberB);
    Console.WriteLine(" - большее число");

    Console.Write(numberA);
    Console.WriteLine(" - меньшее число");
}